{
    "format": "layers-model",
    "generatedBy": "keras v2.10.0",
    "convertedBy": "TensorFlow.js Converter v3.20.0",
    "modelTopology": {
        "keras_version": "2.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                null
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "embedding_input"
                        }
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                null
                            ],
                            "dtype": "float32",
                            "input_dim": 251,
                            "output_dim": 16,
                            "embeddings_initializer": {
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                }
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false,
                            "input_length": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "GlobalAveragePooling1D",
                        "config": {
                            "name": "global_average_pooling1d",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last",
                            "keepdims": false
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 6,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "SparseCategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "sparse_categorical_crossentropy",
                    "from_logits": true,
                    "ignore_class": null
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "SparseTopKCategoricalAccuracy",
                        "config": {
                            "name": "sparse_top_k_categorical_accuracy",
                            "dtype": "float32",
                            "k": 2
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        16,
                        6
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        6
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding/embeddings",
                    "shape": [
                        251,
                        16
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}